OpenFOAM-v1712/tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/cabin/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/cabin";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.2;

boundaryField
{

    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0   0.2)
            (60  0.2)
            (61  0.2)
            (100 0.2)
        );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.2;
        value           uniform 0.2;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    ".*"
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 0.2;
    }
}


// ************************************************************************* //
